Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: ཤཱ་རིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་འདུས་བྱས་ལ་སྤྱོད་པའི་ཆོས་ཐམས་ཅད་ལ་ཤེས་རབ་ཀྱིས་གནས་པ་ཡིན་ཏེ། འདི་ལྟ་སྟེ་མ་རིག་པ་དང་ལྷན་ཅིག་ཏུ་མི་གནས། འདུ་བྱེད་རྣམས་དང་ལྷན་ཅིག་ཏུ་མི་གནས་པ་ནས་རྒྱས་པར་བྱ་སྟེ། རྒ་ཤིའི་བར་དང་ལྷན་ཅིག་ཏུ་མི་གནས། བདག་ཏུ་ལྟ་བ་དང་ལྷན་ཅིག་ཏུ་མི་གནས་པ་ནས་བདག་ཏུ་ལྟ་བའི་རྩ་བ་ལས་བྱུང་བའི་ལྟ་བར་གྱུར་པ་དྲུག་ཅུ་རྩ་གཉིས་དང་ལྷན་ཅིག་ཏུ་མི་གནས། མཐོ་བར་སེམས་པ་དང་ལྷན་ཅིག་ཏུ་མི་གནས། དམའ་བར་སེམས་པ་དང་ལྷན་ཅིག་ཏུ་མི་གནས། འཇིག་རྟེན་གྱི་ཆོས་བརྒྱད་རྣམས་དང་ལྷན་ཅིག་ཏུ་མི་གནས། ང་རྒྱལ་དང་། ཆེ་བའི་ང་རྒྱལ་དང་། ལོག་པའི་ང་རྒྱལ་ནས་ཉེ་བའི་ཉོན་མོངས་པ་ཉི་ཤུའི་བར་དང་ལྷན་ཅིག་ཏུ་མི་གནས། ཆེན་པོ་དང་། འབྲིང་པོ་དང་། ཕྲ་མོ་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱི་བར་དང་ལྷན་ཅིག་ཏུ་མི་གནས། གཏི་མུག་གི་མུན་པ་རབ་རིབ་ཀྱི་ལིང་ཏོག་སྒྲིབ་པ་དང་། ཆོད་པར་བྱེད་པ་ཀུན་ཏུ་དཀྲིས་ཏེ་འདུག་པ་ནས། དམའ་བའི་ཆོས་ཐམས་ཅད་ཀྱི་བར་དང་ལྷན་ཅིག་ཏུ་མི་གནས།
en: “Furthermore, Śāriputra, the bodhisatva who practices the perfection of wisdom dwells in the wisdom that relates to all phenomena as being conditioned. He is not involved with ignorance, he is not involved with mental conditioning, and so forth, and he is not involved with old age and death. He is not involved with the view of self-entity, and he is not involved with any of the other sixty-two kinds of views that have their origin in the view of self-entity. He is not involved with lofty ideas. He is not involved with despondency. He is not involved with the eight ways of the world. He is not involved with pride, arrogance, pride in faults, or any of the twenty other secondary vices. He is not involved with any of the vices, whether gross, subtle, or intermediate. He is not involved with the darkness of confusion, cataract-like veils, obstructing entanglements, or anything else that is inferior.

source: རྩོད་པའི་རྙོག་པ་དང་། ཉོན་མོངས་པ་དང་། ཕུང་པོ་དང་། ལྷའི་བུ་དང་། འཆི་བདག་གི་བདུད་ནས་བདུད་ཐམས་ཅད་ཀྱི་ལས་ཀྱི་བར་དང་ལྷན་ཅིག་ཏུ་མི་གནས། བདག་དང་སེམས་ཅན་དང་། སྲོག་དང་གསོ་བ་དང་། གང་ཟག་དང་། ཤེད་བུ་དང་། ཤེད་ལས་སྐྱེས་པ་ནས་བདག་ཏུ་ལྟ་བ་ཐམས་ཅད་ཀྱི་བར་དང་ལྷན་ཅིག་ཏུ་མི་གནས། ལས་ཀྱི་སྒྲིབ་པ་དང་། ཉོན་མོངས་པའི་སྒྲིབ་པ་དང་། ཆོས་ཀྱི་སྒྲིབ་པ་དང་། ལྟ་བའི་སྒྲིབ་པ་དང་། རྣམ་པར་སྨིན་པའི་སྒྲིབ་པ་དང་། མི་ཤེས་པའི་སྒྲིབ་པ་ནས་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་ཐམས་ཅད་ཀྱི་བར་དང་ལྷན་ཅིག་ཏུ་མི་གནས། ཀུན་ཏུ་རྟོག་པ་དང་། རྣམ་པར་རྟོག་པ་དང་མཚན་མ་དང་། དམིགས་པ་དང་། མཐོང་བ་དང་། ཐོས་པ་དང་། དྲན་པ་དང་། རྣམ་པར་རིག་པ་དང་། མདུད་པའི་སྒྲོ་འདོགས་པ་ཐམས་ཅད་དང་ལྷན་ཅིག་ཏུ་མི་གནས། སེར་སྣ་དང་། གཏོང་བ་དང་། ཚུལ་ཁྲིམས་དང་། འཆལ་པའི་ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། གནོད་སེམས་དང་། བརྩོན་འགྲུས་དང་། ལེ་ལོ་དང་། བསམ་གཏན་དང་། གཡེང་བ་དང་། ཤེས་རབ་དང་། འཆལ་པའི་ཤེས་རབ་ནས་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཕྱོགས་དང་། མི་འཐུན་པའི་ཕྱོགས་དང་། ཤེས་པ་དང་། མི་ཤེས་པའི་བར་ཐམས་ཅད་དང་ལྷན་ཅིག་ཏུ་མི་གནས། ངེས་པ་དང་། མ་ངེས་པ་དང་། ལོག་པར་ངེས་པ་དང་། དགེ་བ་དང་། མི་དགེ་བ་དང་། ཁ་ན་མ་ཐོ་བ་དང་། ཁ་ན་མ་ཐོ་བ་མེད་པ་དང་། འཁོར་བ་དང་མྱ་ངན་ལས་འདས་པ་ནས། ཆོས་ཐམས་ཅད་ཀྱི་གཉེན་པོའི་བར་དང་ལྷན་ཅིག་ཏུ་མི་གནས། ཞིང་སྣ་ཚོགས་དང་། སངས་རྒྱས་སྣ་ཚོགས་དང་། སེམས་ཅན་སྣ་ཚོགས་དང་། ཆོས་སྣ་ཚོགས་ནས་སྣ་ཚོགས་ཐམས་ཅད་ཀྱི་བར་དང་ལྷན་ཅིག་ཏུ་མི་གནས། མི་ཤེས་པ་དང་། ཤེས་པ་དང་། རྣམ་པར་ཤེས་པ་དང་། ཀུན་རྫོབ་དང་། དོན་དམ་པ་ནས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་མཚན་མ་ཡིད་ལ་བྱེད་པ་དག་དང་ལྷན་ཅིག་ཏུ་མི་གནས། ཤེས་རབ་མི་རྒྱུ་བ་དང་། ལུས་མེད་པ་དང་། མཚན་ཉིད་མེད་པ་དང་། མཚན་མ་མེད་པ་དང་། འདུས་མ་བྱས་ནས་ཡིད་ལ་བྱེད་པ་ཐམས་ཅད་དང་། སེམས་དང་རྣམ་པར་ཤེས་པའི་གནས་དག་གི་བར་དང་ལྷན་ཅིག་ཏུ་མི་གནས་ཏེ དེ་དག་དང་གཞན་ཡང་འདུས་བྱས་ལ་སྤྱོད་པའི་ཆོས་དཔག་ཏུ་མེད་པ་དག་དང་ལྷན་ཅིག་ཏུ་མི་གནས་སོ། ། དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་གང་ཤེས་རབ་དེ་ནི་འདུས་བྱས་ཀྱི་སྤྱོད་པ་ཐམས་ཅད་དང་ལྷན་ཅིག་ཏུ་མི་གནས་ཏེ། ཤཱ་རིའི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །
en: He is not involved with the māras of contention, the māras of the vices, the māras of the skandhas, the devaputra māras, the māras of death, or the activities of any of the other māras. He is not involved with the idea of a self, the idea of a being, the idea of a life force, the idea of growth, the idea of a person, the idea of a man, the idea of a human being, the idea of an individual, or any other such views. He is not involved with the obscurations created by actions, the obscurations created by vices, the obscurations created by phenomena, the obscurations created by views, the obscurations created by the ripening of the effects of previous actions, the obscurations created by ignorance, or any other latent habitual tendencies. He is not involved with conceptual ideas, judgements, labels, objects, seeing, hearing, remembering, thinking, or any other mental processes that tie one in knots. He is not involved with envy or rejection, immorality or morality, malice or patience, laziness or vigor, inattention or meditation, stupidity or wisdom, or any other perfect practices or unhelpful practices, not even knowledge and ignorance. He is not involved with having a positive destiny, having no destiny, or having a negative destiny. He is not involved with what is wholesome or what is unwholesome, with the irreproachable or the reproachable, with cyclic existence or nirvāṇa, or with any other categories such as these. He is not involved with making distinctions between different places, different buddhas, different beings, or different Dharma teachings, or with making any other kind of distinctions. He is not involved with inexperience, knowledge, or comprehension, with the relative truth and the ultimate truth, or with any other kind of mental labeling that sentient beings are involved with. He is not involved with unmoving wisdom, incorporeality, freedom from essential characteristics, freedom from attributes, being unconditioned, or any other such mental exertions, states of mind, or states of consciousness. He is not involved with these or any other immeasurable ways of relating to conditioned phenomena. The wisdom of the bodhisatva who practices the perfection of wisdom lies in his not being involved with any phenomena in the realm of the conditioned. In this way, Śāriputra, the bodhisatva practices the perfection of wisdom.

source: ཤཱ་རིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ལ་གནས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམ་པར་འབྱེད་མཁས་པ་ཡིན་ཏེ ཆོས་ཐམས་ཅད་ལ་མཁས་པ་རྗེས་སུ་འཐོབ་བོ། །དེ་ལ་ཤེས་རབ་རྣམ་པར་འབྱེད་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ་ཕུང་པོ་ལ་མཁས་པ་དང་། ཁམས་ལ་མཁས་པ་དང་། སྐྱེ་མཆེད་ལ་མཁས་པ་དང་། བདེན་པ་ལ་མཁས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་ལ་མཁས་པ་དང་། རྟོན་པ་ལ་མཁས་པ་དང་། རྣམ་པར་ཤེས་པ་དང་། ཡེ་ཤེས་ལ་མཁས་པ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་ལ་མཁས་པ་དང་། ལམ་ལ་མཁས་པ་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལ་མཁས་པ་དང་བཅུ་སྟེ། མཁས་པ་རྣམ་པ་བཅུ་པོ་འདི་དག་གི་རྣམ་པར་འབྱེད་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་རྣམ་པར་འབྱེད་པ་ཞེས་བྱའོ། །
en: “Furthermore, Śāriputra, the bodhisatva who has mastered The Collected Teachings on the Bodhisatva and practices the perfection of wisdom is skilled in the different features of the perfection of wisdom, and so he masters all phenomena. What are these different features of wisdom? There are ten: a skilled approach to skandhas, a skilled approach to elements, a skilled approach to sense fields, a skilled approach to truth, a skilled approach to analytical abilities, a skilled approach to relying on things, a skilled approach to consciousness and knowledge, a skilled approach to the factors of awakening, a skilled approach to the path, and a skilled approach to dependent arising. This tenfold division of skill is what is known as the different features of wisdom.

source: དེ་ལ་ཕུང་པོ་ལ་མཁས་པ་གང་ཞེ་ན། གང་འདི་ཕུང་པོ་རྣམས་ཀྱི་དཔེར་བྱ་བ་བསྟན་པ་འདི་ལྟ་སྟེ། དབུ་བ་རྡོས་པ་ལྟ་བུར་བསྟན་པ་དང་། སྨིག་རྒྱུ་ལྟ་བུར་བསྟན་པ་དང་། ཆུ་བུར་ལྟ་བུར་བསྟན་པ་དང་། ཆུ་ཤིང་ལྟ་བུར་བསྟན་པ་དང་། སྒྱུ་མ་ལྟ་བུར་བསྟན་པ་དང་། རྨི་ལམ་ལྟ་བུར་བསྟན་པ་དང་། བྲག་ཅ་ལྟ་བུར་བསྟན་པ་དང་། མིག་ཡོར་ལྟ་བུར་བསྟན་པ་དང་། གཟུགས་བརྙན་ལྟ་བུར་བསྟན་པའོ། ། གཟུགས་ནི་ཆུའི་དབུ་བ་ལྟ་བུ་སྟེ། དབུ་བ་ལ་ཡང་བདག་མེད། སེམས་ཅན་མེད། སྲོག་མེད། གང་ཟག་མེད། སྐྱེས་བུ་མེད། ཤེད་བུ་མེད། ཤེད་ལས་སྐྱེས་མེད་དེ། དབུ་བའི་རང་བཞིན་གང་ཡིན་པ་གཟུགས་ཀྱང་དེའི་རང་བཞིན་ཡིན་ཏེ། གང་དེ་ལ་མཁས་པ་དེ་ནི་ཕུང་པོ་ལ་མཁས་པ་ཞེས་བྱའོ། ། ཚོར་བ་ནི་ཆུའི་ཆུ་བུར་ལྟ་བུ་སྟེ། ཆུ་བུར་ལ་ཡང་བདག་མེད། སེམས་ཅན་མེད། སྲོག་མེད། གང་ཟག་མེད། ཤེད་བུ་མེད། ཤེད་ལས་སྐྱེས་མེད། སྐྱེ་བ་པོ་མེད། སྐྱེས་བུ་མེད་དེ། ཆུ་བུར་གྱི་རང་བཞིན་གང་ཡིན་པ་ཚོར་བ་ཡང་དེའི་རང་བཞིན་ཡིན་ཏེ། གང་དེ་ལ་མཁས་པ་འདི་ནི་ཕུང་པོ་ལ་མཁས་པ་ཞེས་བྱའོ། ། འདུ་ཤེས་ནི་སྨིག་རྒྱུ་ལྟ་བུ་སྟེ། སྨིག་རྒྱུ་ལ་ཡང་བདག་མེད། སེམས་ཅན་མེད་པ་ནས་སྐྱེས་བུའི་བར་དུ་མེད་དེ། སྨིག་རྒྱུའི་རང་བཞིན་གང་ཡིན་པ་འདུ་ཤེས་ཀྱང་དེའི་རང་བཞིན་ཡིན་ཏེ། གང་དེ་ལ་མཁས་པ་དེ་ནི་ཕུང་པོ་ལ་མཁས་པ་ཞེས་བྱའོ། ། འདུ་བྱེད་རྣམས་ནི་ཆུ་ཤིང་ལྟ་བུ་སྟེ། ཆུ་ཤིང་ལ་ཡང་བདག་མེད། སེམས་ཅན་མེད། སྲོག་མེད་པ་ནས། སྐྱེས་བུའི་བར་དུ་མེད་པ་སྟེ། ཆུ་ཤིང་གི་རང་བཞིན་གང་ཡིན་པ་འདུ་བྱེད་དག་ཀྱང་དེའི་རང་བཞིན་ཡིན་ཏེ། གང་དེ་ལ་མཁས་པ་དེ་ནི་ཕུང་པོ་ལ་མཁས་པ་ཞེས་བྱའོ། ། རྣམ་པར་ཤེས་པ་ནི་སྒྱུ་མ་ལྟ་བུ་སྟེ། སྒྱུ་མ་ལ་ཡང་བདག་མེད། སེམས་ཅན་མེད། སྲོག་མེད། གང་ཟག་མེད། ཤེད་བུ་མེད། ཤེད་ལས་སྐྱེས་མེད། སྐྱེས་བུ་མེད། བྱེད་པ་པོ་མེད། ཚོར་བ་པོ་མེད་པ་སྟེ། སྒྱུ་མའི་རང་བཞིན་གང་ཡིན་པ་རྣམ་པར་ཤེས་པའི་རང་བཞིན་ཡང་དེ་ཡིན་ཏེ། གང་དེ་ལ་མཁས་པ་དེ་ནི་ཕུང་པོ་ལ་མཁས་པ་ཞེས་བྱའོ། །
en: “What does it mean, then, to have a skilled approach to the skandhas? One can illustrate the skandhas by giving some examples. They can be compared to froth, to a mirage, to a bubble, to a plantain tree, to an illusion, to a dream, to an echo, to a hallucination, and to a reflection. Form is like froth in that froth has no self, no being, no life force, no person, no man, no human, and no individual. Form has as much essential nature as froth. This skillful way of understanding things is what is known as having a skilled approach to the skandhas. Feeling is like a bubble. A bubble has no self, no being, no life force, no person, no human, no individual, no offspring, and no man. Feeling has as much essential nature as a bubble. This skillful way of understanding things is what is known as having a skilled approach to skandhas. Perception is like a mirage. A mirage has no self, no being, no life force, and so forth, and no man. Perception has as much essential nature as a mirage. This skillful way of understanding things is what is known as having a skilled approach to skandhas. Mental conditioning is like a plantain tree. A plantain tree has no self, no being, no life force, and so forth, and no man. Mental conditioning has as much essential nature as a plantain tree. This skillful way of understanding things is what is known as having a skilled approach to skandhas. Consciousness is like an illusion. An illusion has no self, no being, no life force, no person, no human, no individual, no man, no one who acts, and no one who experiences. Consciousness has as much essential nature as an illusion. This skillful way of understanding things is what is known as having a skilled approach to skandhas.

source: གཞན་ཡང་ཕུང་པོ་རྣམས་ཞེས་བྱ་བ་ནི་འཇིག་རྟེན་ཡིན་ཏེ། འཇིག་རྟེན་ཡང་འཇིག་པའི་མཚན་ཉིད་དོ། ། འཇིག་རྟེན་རྣམས་ཀྱི་རང་བཞིན་གང་ཡིན་པ་ཕུང་པོ་རྣམས་ཀྱི་རང་བཞིན་ཡང་དེ་ཡིན་ནོ། ། ཡང་འཇིག་རྟེན་གྱི་རང་བཞིན་གང་ཡིན་ཞེ་ན། འདི་ལྟ་སྟེ། མི་རྟག་པའི་རང་བཞིན་དང་། སྡུག་བསྔལ་གྱི་རང་བཞིན་ཏེ། ཕུང་པོ་ཡང་དེའི་རང་བཞིན་ཡིན་ནོ། ། གང་དེ་ལ་མཁས་པ་དེ་ནི་ཕུང་པོ་ལ་མཁས་པ་ཞེས་བྱའོ། ། དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཕུང་པོ་ལ་མཁས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །
en: “Moreover, the skandhas are what is known as the world, and the world is characterized by the fact that it is destroyed. That which is the essential nature of the world is the essential nature of the skandhas. What is the essential nature of the world? It is by nature impermanent, and it is by nature suffering. This, too, is the nature of the skandhas. This skillful way of understanding things is what is known as having a skilled approach to the skandhas. This is how the bodhisatva who has a skilled approach to the skandhas practices the perfection of wisdom.

source: དེ་ལ་ཁམས་ལ་མཁས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཆོས་ཀྱི་ཁམས་ནི་སའི་ཁམས་མོད་ཀྱི་ཆོས་ཀྱི་ཁམས་སྲ་བའི་མཚན་ཉིད་མ་ཡིན་ནོ། ། ཆོས་ཀྱི་ཁམས་ནི་ཆུའི་ཁམས་མོད་ཀྱི་ཆོས་ཀྱི་ཁམས་རླན་པའི་མཚན་ཉིད་མ་ཡིན་ནོ། ། ཆོས་ཀྱི་ཁམས་ནི་མེའི་ཁམས་མོད་ཀྱི་ཆོས་ཀྱི་ཁམས་ཚ་བའི་མཚན་ཉིད་མ་ཡིན་ནོ། ། ཆོས་ཀྱི་ཁམས་ནི་རླུང་གི་ཁམས་མོད་ཀྱི་ཆོས་ཀྱི་ཁམས་གཡོ་བའི་མཚན་ཉིད་མ་ཡིན་ནོ། ། ཆོས་ཀྱི་ཁམས་ནི་མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་མོད་ཀྱི་ཆོས་ཀྱི་ཁམས་མཐོང་བའི་མཚན་ཉིད་མ་ཡིན་ནོ། ། ཆོས་ཀྱི་ཁམས་ནི་རྣ་བའི་རྣམ་པར་ཤེས་པའི་ཁམས་མོད་ཀྱི་ཆོས་ཀྱི་ཁམས་སྒྲ་རྟོག་པའི་མཚན་ཉིད་མ་ཡིན་ནོ། ། ཆོས་ཀྱི་ཁམས་ནི་སྣའི་རྣམ་པར་ཤེས་པའི་ཁམས་མོད་ཀྱི་ཆོས་ཀྱི་ཁམས་དྲི་སྣོམ་པའི་མཚན་ཉིད་མ་ཡིན་ནོ། ། ཆོས་ཀྱི་ཁམས་ནི་ལྕེའི་རྣམ་པར་ཤེས་པའི་ཁམས་མོད་ཀྱི་ཆོས་ཀྱི་ཁམས་རོ་མྱོང་བའི་མཚན་ཉིད་མ་ཡིན་ནོ། ། ཆོས་ཀྱི་ཁམས་ནི་ལུས་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་མོད་ཀྱི་ཆོས་ཀྱི་ཁམས་རེག་པའི་མཚན་ཉིད་མ་ཡིན་ནོ། ། ཆོས་ཀྱི་ཁམས་ནི་ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་མོད་ཀྱི་ཆོས་ཀྱི་ཁམས་རྣམ་པར་སྒོམ་པའི་མཚན་ཉིད་མ་ཡིན་ནོ། །
en: “What does it mean, then, to have a skilled approach to the elements? The element of phenomena is the earth element, but the element of phenomena does not have the essential characteristic of firmness. The element of phenomena is the water element, but the element of phenomena does not have the essential characteristic of fluidity. The element of phenomena is the fire element, but the element of phenomena does not have the essential characteristic of heat. The element of phenomena is the wind element, but the element of phenomena does not have the essential characteristic of movement. The element of phenomena is the element of eye consciousness, but the element of phenomena does not have the essential characteristic of visibility. The element of phenomena is the element of the ear consciousness, but the element of phenomena does not have the essential characteristic of hearing. The element of phenomena is the element of the nose consciousness, but the element of phenomena does not have the essential characteristic of smelling. The element of phenomena is the element of the tongue consciousness, but the element of phenomena does not have the essential characteristic of tasting. The element of phenomena is the element of the physical consciousness, but the element of phenomena does not have the essential characteristic of touching. The element of phenomena is the element of the mental consciousness, but the element of phenomena does not have the essential characteristic of experiencing.

source: ཆོས་ཀྱི་ཁམས་དང་བདག་གི་ཁམས་དེ་ནི་མཚུངས་སོ། ། འདོད་པའི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་། གཟུགས་མེད་པའི་ཁམས་ནི་མཚུངས་སོ། ། འཁོར་བའི་ཁམས་དང་། མྱ་ངན་ལས་འདས་པའི་ཁམས་དེ་མཚུངས་སོ། །
en: “The element of self and the element of phenomena are the same. The element of the realm of desire, the element of the realm of form, and the element of the formless realm are the same. The element of cyclic existence and the element of nirvāṇa are the same.

source: དེ་ལྟར་ཆོས་ཐམས་ཅད་ཀྱི་ཁམས་དང་། ནམ་མཁའི་ཁམས་དེ་མཚུངས་ཏེ། སྟོང་པ་ཉིད་དང་མཚུངས་པས་མཚུངས་མི་འགྱུར་བ་དང་མཚུངས་པས་མཚུངས་ཏེ། འདུས་བྱས་ཀྱི་ཁམས་སུ་འཇུག་པ་དང་། འདུས་མ་བྱས་ཀྱི་ཁམས་སུ་འཇུག་པའི་ཕྱིར་དེ་ལ་བཤད་པ་དཔག་ཏུ་མེད་དེ། གང་ཁམས་ལ་འཇུག་པ་དེས་རབ་ཏུ་རྣམ་པར་འབྱེད་པ་དེ་ནི་མཁས་པ་ཞེས་བྱའོ། ། དེ་ལྟར་ན་ཁམས་ལ་མཁས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །
en: “In this way, the element of space and the element of all phenomena are the same. This is the sameness of being the same as emptiness. It is the sameness of being the same as changelessness. These statements, which have been made in order to help one relate to the element of the conditioned and to the element of the unconditioned, are unfathomable, and someone who investigates things by approaching the elements in this way is known as someone who has a skilled approach to the elements. This is how a bodhisatva, a great being who has a skilled approach to the elements, practices the perfection of wisdom.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་མཆེད་ལ་མཁས་པ་གང་ཞེ་ན། འདི་ལ་མིག་བདག་དང་བདག་གིས་སྟོང་པ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་མིག་གི་རང་བཞིན་འདི་ལྟ་བུའོ། ། ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་ཏེ། དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་མཆེད་ལ་མཁས་པའོ། ། གོང་མ་བཞིན་དུ་སྦྱར་ཏེ། དེ་བཞིན་དུ་རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་དང་། ཡིད་བདག་དང་བདག་གིས་སྟོང་པ་དེ་བྱང་ཆུབ་སེམས་དཔའ་ཡིད་ཀྱི་རང་བཞིན་ནི་འདི་ལྟ་བུའོ། །
en: “What is the bodhisatva’s skilled approach to the sense fields like? This eye is empty of a self and an owner, and the bodhisatva knows that this is how it is: ‘This is the nature of the eye.’ This is the bodhisatva’s skilled approach to the sense fields. Likewise, the ear, the nose, the tongue, the body, and the mind are empty of a self and of an owner, and the bodhisatva knows that this is how it is, and so forth: ‘This is the nature of the mind.’

source: ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་ཏེ། དགེ་བ་སྩོགས་པའི་ཕྱིར་གང་སྐྱེ་མཆེད་ལ་ཀུན་སྩོགས་པ་དང་། སྣ་ཚོགས་སྩོགས་པ་དེ་དག་སྩོགས་པར་མི་བྱེད་ཅིང་དགེ་བ་དང་མི་དགེ་བའི་ཆོས་རྣམས་ལ་འདུ་ཤེས་གཉིས་སུ་མི་འཇུག་སྟེ དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་མཆེད་ལ་མཁས་པའོ། །
en: “He does not engage in the building up of stocks of wholesome qualities, accumulating them and piling them up by means of the sense fields, and he does not make any distinction between wholesome and unwholesome qualities. This is the bodhisatva’s skilled approach to the sense fields.

source: འདི་ནི་མིག་གི་སྐྱེ་མཆེད་དོ། ། འདི་ནི་གཟུགས་ཀྱི་སྐྱེ་མཆེད་དོ། ། ཞེས་དེ་ལྟར་མིག་དང་གཟུགས་རྣམས་ལ་འདོད་ཆགས་མེད་པར་མཐོང་ཡང་འདོད་ཆགས་མེད་པ་མངོན་དུ་མི་བྱེད་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་མཆེད་ལ་མཁས་པའོ། ། རྣ་བ་དང་སྒྲ། སྣ་དང་དྲི། ལྕེ་དང་རོ། ལུས་དང་རེག ། ཡིད་དང་ཆོས། གོང་མ་བཞིན་དུ་སྦྱར་ཏེ། དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ཡིད་དང་ཆོས་ཀྱི་བར་དུ་འདོད་ཆགས་མེད་པར་མཐོང་མོད་ཀྱི། འདོད་ཆགས་མེད་པ་མངོན་དུ་མི་བྱེད་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་མཆེད་ལ་མཁས་པའོ། ། སྐྱེ་མཆེད་ཅེས་བྱ་བ་ཡང་འཕགས་པའི་སྐྱེ་མཆེད་དང་། འཕགས་པ་མ་ཡིན་པའི་སྐྱེ་མཆེད་དེ། དེ་ལ་འཕགས་པའི་སྐྱེ་མཆེད་ནི་གང་ལམ་སྡུད་པར་བྱེད་པའོ། ། འཕགས་པ་མ་ཡིན་པའི་སྐྱེ་མཆེད་ནི་གང་ལམ་གཏོང་བར་བྱེད་པ་འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་ལམ་ལ་གནས་པ་ནི་སེམས་ཅན་ལམ་ལ་བརྩོན་པ་བོར་ཞིང་གནས་པ་ལ་སྙིང་རྗེ་ཆེན་པོ་འཐོབ་ཅིང་ལམ་གྱི་སྐྱེ་མཆེད་ཀྱང་མི་གཏོང་བ་སྟེ། དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་མཆེད་ལ་མཁས་པའོ། ། དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་མཆེད་ཀྱང་མི་གཏོང་བ་སྟེ། དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་མཆེད་ལ་མཁས་པའོ། ། དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་མཆེད་ལ་མཁས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །
en: “Although he observes the eye and forms dispassionately, thinking, ‘This is the sense field of the eye, this is the sense field of form,’ he does not reify this dispassion. This is the bodhisatva’s skilled approach to the sense fields. Although he thinks, ‘This is the sense field of the ear, of sound, of the nose, of smell, of the tongue, of taste, of the body, of touch, of the mind, of mental phenomena,’ when he observes the mind and mental phenomena with dispassion, he does not reify this dispassion. This is the bodhisatva’s skilled approach to the sense fields. In regard to the sense fields, there are the sense fields of the noble ones and the sense fields of those who are not noble ones. In this context, the sense fields of the noble ones are those that are connected to the path, while the sense fields of those who are not noble ones have no relation to the path. In this context, the bodhisatva who is established on the path will have great compassion for those sentient beings who do not take the Dharma seriously, and he will not abandon the sense fields that are related to the path. This is the bodhisatva’s skilled approach to the sense fields.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་བདེན་པ་ལ་མཁས་པ་གང་ཞེ་ན། བྱང་ཆུབ་སེམས་དཔའི་བདེན་པ་ལ་འཇུག་པ་མཁས་པ་ནི་རྣམ་པ་བཞི་སྟེ། འདི་ལྟ་སྟེ། སྡུག་བསྔལ་ཤེས་པ་དང་། ཀུན་འབྱུང་བ་ཤེས་པ་དང་། འགོག་པ་ཤེས་པ་དང་། ལམ་ཤེས་པའོ། ། དེ་ལ་སྡུག་བསྔལ་ཤེས་པ་གང་ཞེ་ན། གང་ཕུང་པོ་རྣམས་ལ་མི་སྐྱེ་བར་ཤེས་པ་དེ་ནི་སྡུག་བསྔལ་ཤེས་པ་ཞེས་བྱའོ། ། དེ་ལ་ཀུན་འབྱུང་བ་ཤེས་པ་གང་ཞེ་ན། གང་སྲེད་པ་འཇོམས་པ་དེ་ནི་ཀུན་འབྱུང་བ་ཤེས་པ་ཞེས་བྱའོ། ། དེ་ལ་འགོག་པ་ཤེས་པ་གང་ཞེ་ན། གང་མི་འབྱུང་མི་འཇིག་པར་ཤེས་པ་དེ་ནི་འགོག་པ་ཤེས་པ་ཞེས་བྱའོ། ། དེ་ལ་ལམ་ཤེས་པ་གང་ཞེ་ན། གང་མཉམ་པ་ཉིད་ཐོབ་པའི་ཆོས་རྣམས་ལ་སྒྲོ་མི་འདོགས་པ་དེ་ནི་ལམ་ཤེས་པ་ཞེས་བྱའོ། ། གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔས་བདེན་པ་བཞི་དེ་ལྟར་ཤེས་རབ་ཀྱིས་ཤེས་ཀྱང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་མངོན་དུ་མི་བྱེད་པ་དེ་ནི་བདེན་པ་ལ་མཁས་པ་ཞེས་བྱའོ། །
en: “What is the bodhisatva’s skilled approach to truth? There are four aspects to the bodhisatva’s skilled approach to truth. These are understanding suffering, understanding its source, understanding its cessation, and understanding the path. What does it mean to understand suffering? Understanding suffering means to understand that nothing takes place in the skandhas. What does it mean to understand its source? Understanding the source means to understand that craving is destroyed. What does it mean to understand its cessation? Understanding cessation means to understand that suffering is neither produced nor destroyed. What does it mean to understand the path? Understanding the path means not reifying the teachings on the attainment of sameness. Then, although the bodhisatva sees these four truths with this kind of wisdom, he does not reify it, so that he will be able to bring sentient beings to maturity. This is what is known as a skilled approach to truth.

source: གཞན་ཡང་བདེན་པ་ལ་མཁས་པ་རྣམ་པ་གསུམ་སྟེ། འདི་ལྟ་སྟེ། ཀུན་རྫོབ་ཀྱི་བདེན་པ་དང་། དོན་དམ་པའི་བདེན་པ་དང་། མཚན་ཉིད་ཀྱི་བདེན་པའོ། ། དེ་ལ་ཀུན་རྫོབ་ཀྱི་བདེན་པ་ནི་འཇིག་རྟེན་གྱི་ཐ་སྙད་ཇི་སྙེད་པ་དང་། ཡི་གེ་དང་སྒྲ་དང་། བརྡར་བསྟན་པ་སྟེ། དེ་ནི་ཀུན་རྫོབ་ཀྱི་བདེན་པ་ཞེས་བྱའོ། ། དེ་ལ་དོན་དམ་པའི་བདེན་པ་གང་ཞེ་ན། གང་ལ་སེམས་ཀྱི་རྒྱུ་བ་ཡང་མེད་ན་ཡི་གེ་ལྟ་ཅི་སྨོས་ཏེ། དེ་ནི་དོན་དམ་པའི་བདེན་པ་ཞེས་བྱའོ། ། དེ་ལ་མཚན་ཉིད་ཀྱི་བདེན་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། མཚན་ཉིད་ཐམས་ཅད་མཚན་ཉིད་གཅིག་ལ་མཚན་ཉིད་གཅིག་པ་ནི་མཚན་ཉིད་མེད་པའོ། ། དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་རྫོབ་ཀྱི་བདེན་པ་འཆད་པས་མི་སྐྱོ། དོན་དམ་པའི་བདེན་པ་མངོན་དུ་བྱེད་པར་མི་ལྟུང་། མཚན་ཉིད་ཀྱི་བདེན་པ་མཚན་ཉིད་མེད་པས་རྟོགས་པར་བྱེད་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བདེན་པ་ལ་མཁས་པ་ཞེས་བྱའོ། །
en: “Moreover, there are three more aspects to his skilled approach to truth. These are the relative truth, the ultimate truth, and the truth of essential characteristics. With regard to the relative truth, anything that is a worldly convention and is communicated by means of syllables, sounds, and terminology is what is known as the relative truth. With regard to the ultimate truth, it is what the mind cannot accommodate, and it also does not involve verbal communication. This is what is known as the ultimate truth. What is the truth of essential characteristics? It is that all essential characteristics come down to one essential characteristic, and this one essential characteristic is that there are no essential characteristics. The bodhisatva never tires of teaching the relative truth, does not fall into a reification of the ultimate truth, and characterizes the truth of essential characteristics by means of the fact that they have no essential characteristics. This is what is known as a skilled approach to truth.

source: གཞན་ཡང་བདེན་པ་ནི་གཅིག་པུ་གཉིས་མ་ཡིན་པ་སྟེ། འདི་ལྟ་སྟེ། འགོག་པའི་བདེན་པའོ། ། དེ་ལ་བདེན་པ་གཅིག་པུ་ལ་གང་སྒྲོ་མི་འདོགས་པ་དང་། སེམས་ཅན་སྒྲོ་འདོགས་པར་ལྷུང་བ་རྣམས་ལ་བདེན་པ་སྦྱོར་བར་བྱེད་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བདེན་པ་ལ་མཁས་པ་ཞེས་བྱའོ། །
en: “Moreover, the single truth is without another. It is the truth of cessation. It is a singular truth that cannot be elaborated upon, yet still he describes it to sentient beings in order to provide access to this truth. This is what is known as a skilled approach to truth.
